[M_Orchid_Raid1 MissionDefinition]
MissionDescription="After the opening of the Vault, more and more dangerous alien creatures have awakened on Pandora. They are unique. They are magnificent. They are going to drop some REALLY good loot if you kill them. Better bring your friends, though: the Seraphs aren't gonna go down easily."
TurnInDescription="You've defeated Hyperius the Invincible!"
TeaserText="The Seraphs are waiting..."

[M_Orchid_Raid3 MissionDefinition]
MissionDescription="After the opening of the Vault, more and more dangerous alien creatures have awakened on Pandora. They are unique. They are magnificent. They are going to drop some REALLY good loot if you kill them. Better bring your friends, though: the Seraphs aren't gonna go down easily."
TurnInDescription="You've defeated Master Gee!"
TeaserText="The Seraphs are waiting..."
